{
  "100": 0,
  "1000": 1,
  "101": 2,
  "102": 3,
  "103": 4,
  "104": 5,
  "105": 6,
  "106": 7,
  "107": 8,
  "108": 9,
  "109": 10,
  "11": 11,
  "110": 12,
  "111": 13,
  "113": 14,
  "114": 15,
  "115": 16,
  "116": 17,
  "117": 18,
  "118": 19,
  "119": 20,
  "12": 21,
  "120": 22,
  "121": 23,
  "122": 24,
  "123": 25,
  "124": 26,
  "125": 27,
  "126": 28,
  "127": 29,
  "128": 30,
  "129": 31,
  "130": 32,
  "131": 33,
  "132": 34,
  "134": 35,
  "135": 36,
  "136": 37,
  "137": 38,
  "138": 39,
  "139": 40,
  "14": 41,
  "140": 42,
  "141": 43,
  "142": 44,
  "143": 45,
  "144": 46,
  "145": 47,
  "146": 48,
  "147": 49,
  "148": 50,
  "149": 51,
  "15": 52,
  "150": 53,
  "151": 54,
  "152": 55,
  "153": 56,
  "154": 57,
  "155": 58,
  "156": 59,
  "157": 60,
  "158": 61,
  "159": 62,
  "16": 63,
  "160": 64,
  "161": 65,
  "162": 66,
  "163": 67,
  "164": 68,
  "165": 69,
  "166": 70,
  "167": 71,
  "168": 72,
  "169": 73,
  "17": 74,
  "170": 75,
  "171": 76,
  "172": 77,
  "173": 78,
  "174": 79,
  "175": 80,
  "176": 81,
  "177": 82,
  "178": 83,
  "179": 84,
  "180": 85,
  "181": 86,
  "182": 87,
  "183": 88,
  "184": 89,
  "185": 90,
  "186": 91,
  "187": 92,
  "188": 93,
  "189": 94,
  "190": 95,
  "191": 96,
  "192": 97,
  "193": 98,
  "194": 99,
  "195": 100,
  "196": 101,
  "197": 102,
  "198": 103,
  "199": 104,
  "20": 105,
  "200": 106,
  "201": 107,
  "202": 108,
  "203": 109,
  "204": 110,
  "205": 111,
  "206": 112,
  "207": 113,
  "208": 114,
  "209": 115,
  "21": 116,
  "210": 117,
  "211": 118,
  "212": 119,
  "213": 120,
  "214": 121,
  "215": 122,
  "216": 123,
  "217": 124,
  "218": 125,
  "219": 126,
  "22": 127,
  "220": 128,
  "221": 129,
  "222": 130,
  "223": 131,
  "225": 132,
  "226": 133,
  "227": 134,
  "228": 135,
  "229": 136,
  "23": 137,
  "230": 138,
  "231": 139,
  "232": 140,
  "233": 141,
  "234": 142,
  "235": 143,
  "236": 144,
  "237": 145,
  "238": 146,
  "239": 147,
  "24": 148,
  "240": 149,
  "241": 150,
  "242": 151,
  "243": 152,
  "244": 153,
  "245": 154,
  "246": 155,
  "247": 156,
  "248": 157,
  "249": 158,
  "25": 159,
  "250": 160,
  "251": 161,
  "252": 162,
  "253": 163,
  "254": 164,
  "255": 165,
  "256": 166,
  "257": 167,
  "259": 168,
  "26": 169,
  "260": 170,
  "261": 171,
  "262": 172,
  "263": 173,
  "264": 174,
  "265": 175,
  "266": 176,
  "267": 177,
  "268": 178,
  "269": 179,
  "27": 180,
  "270": 181,
  "271": 182,
  "272": 183,
  "273": 184,
  "274": 185,
  "275": 186,
  "276": 187,
  "277": 188,
  "278": 189,
  "279": 190,
  "28": 191,
  "280": 192,
  "281": 193,
  "282": 194,
  "283": 195,
  "284": 196,
  "285": 197,
  "286": 198,
  "287": 199,
  "288": 200,
  "289": 201,
  "29": 202,
  "290": 203,
  "291": 204,
  "292": 205,
  "293": 206,
  "294": 207,
  "295": 208,
  "296": 209,
  "297": 210,
  "298": 211,
  "299": 212,
  "30": 213,
  "300": 214,
  "301": 215,
  "302": 216,
  "303": 217,
  "304": 218,
  "305": 219,
  "306": 220,
  "307": 221,
  "308": 222,
  "309": 223,
  "31": 224,
  "310": 225,
  "311": 226,
  "312": 227,
  "313": 228,
  "314": 229,
  "315": 230,
  "316": 231,
  "317": 232,
  "318": 233,
  "319": 234,
  "32": 235,
  "320": 236,
  "321": 237,
  "322": 238,
  "324": 239,
  "325": 240,
  "326": 241,
  "327": 242,
  "328": 243,
  "329": 244,
  "33": 245,
  "330": 246,
  "331": 247,
  "332": 248,
  "333": 249,
  "334": 250,
  "335": 251,
  "336": 252,
  "337": 253,
  "338": 254,
  "339": 255,
  "34": 256,
  "340": 257,
  "341": 258,
  "342": 259,
  "343": 260,
  "344": 261,
  "345": 262,
  "346": 263,
  "347": 264,
  "348": 265,
  "349": 266,
  "35": 267,
  "350": 268,
  "351": 269,
  "352": 270,
  "353": 271,
  "354": 272,
  "355": 273,
  "356": 274,
  "357": 275,
  "358": 276,
  "359": 277,
  "36": 278,
  "360": 279,
  "361": 280,
  "362": 281,
  "363": 282,
  "364": 283,
  "365": 284,
  "366": 285,
  "367": 286,
  "368": 287,
  "369": 288,
  "37": 289,
  "370": 290,
  "371": 291,
  "372": 292,
  "373": 293,
  "374": 294,
  "375": 295,
  "376": 296,
  "377": 297,
  "378": 298,
  "379": 299,
  "38": 300,
  "380": 301,
  "381": 302,
  "382": 303,
  "383": 304,
  "384": 305,
  "385": 306,
  "386": 307,
  "388": 308,
  "389": 309,
  "39": 310,
  "390": 311,
  "391": 312,
  "392": 313,
  "393": 314,
  "394": 315,
  "395": 316,
  "396": 317,
  "397": 318,
  "398": 319,
  "399": 320,
  "40": 321,
  "400": 322,
  "401": 323,
  "402": 324,
  "403": 325,
  "404": 326,
  "406": 327,
  "407": 328,
  "408": 329,
  "409": 330,
  "41": 331,
  "410": 332,
  "411": 333,
  "412": 334,
  "413": 335,
  "414": 336,
  "415": 337,
  "416": 338,
  "417": 339,
  "418": 340,
  "419": 341,
  "42": 342,
  "420": 343,
  "421": 344,
  "422": 345,
  "423": 346,
  "424": 347,
  "425": 348,
  "426": 349,
  "427": 350,
  "428": 351,
  "429": 352,
  "43": 353,
  "430": 354,
  "431": 355,
  "432": 356,
  "433": 357,
  "434": 358,
  "435": 359,
  "436": 360,
  "437": 361,
  "438": 362,
  "439": 363,
  "44": 364,
  "440": 365,
  "441": 366,
  "443": 367,
  "444": 368,
  "445": 369,
  "446": 370,
  "447": 371,
  "448": 372,
  "449": 373,
  "45": 374,
  "450": 375,
  "451": 376,
  "452": 377,
  "453": 378,
  "454": 379,
  "455": 380,
  "456": 381,
  "457": 382,
  "458": 383,
  "459": 384,
  "46": 385,
  "460": 386,
  "461": 387,
  "462": 388,
  "463": 389,
  "464": 390,
  "465": 391,
  "466": 392,
  "467": 393,
  "468": 394,
  "469": 395,
  "47": 396,
  "470": 397,
  "471": 398,
  "472": 399,
  "473": 400,
  "474": 401,
  "475": 402,
  "476": 403,
  "477": 404,
  "478": 405,
  "479": 406,
  "48": 407,
  "480": 408,
  "481": 409,
  "482": 410,
  "483": 411,
  "484": 412,
  "485": 413,
  "486": 414,
  "487": 415,
  "488": 416,
  "489": 417,
  "49": 418,
  "490": 419,
  "491": 420,
  "492": 421,
  "493": 422,
  "494": 423,
  "495": 424,
  "496": 425,
  "497": 426,
  "498": 427,
  "499": 428,
  "50": 429,
  "500": 430,
  "502": 431,
  "503": 432,
  "504": 433,
  "505": 434,
  "506": 435,
  "507": 436,
  "508": 437,
  "509": 438,
  "51": 439,
  "511": 440,
  "512": 441,
  "513": 442,
  "514": 443,
  "515": 444,
  "516": 445,
  "519": 446,
  "52": 447,
  "520": 448,
  "522": 449,
  "523": 450,
  "524": 451,
  "525": 452,
  "526": 453,
  "527": 454,
  "528": 455,
  "529": 456,
  "53": 457,
  "530": 458,
  "532": 459,
  "537": 460,
  "539": 461,
  "54": 462,
  "540": 463,
  "541": 464,
  "542": 465,
  "545": 466,
  "547": 467,
  "548": 468,
  "55": 469,
  "551": 470,
  "554": 471,
  "557": 472,
  "558": 473,
  "559": 474,
  "56": 475,
  "562": 476,
  "563": 477,
  "565": 478,
  "567": 479,
  "569": 480,
  "57": 481,
  "570": 482,
  "571": 483,
  "572": 484,
  "574": 485,
  "575": 486,
  "576": 487,
  "578": 488,
  "579": 489,
  "58": 490,
  "580": 491,
  "581": 492,
  "582": 493,
  "583": 494,
  "584": 495,
  "585": 496,
  "587": 497,
  "588": 498,
  "59": 499,
  "591": 500,
  "592": 501,
  "593": 502,
  "596": 503,
  "597": 504,
  "598": 505,
  "599": 506,
  "60": 507,
  "600": 508,
  "601": 509,
  "603": 510,
  "604": 511,
  "605": 512,
  "607": 513,
  "608": 514,
  "609": 515,
  "61": 516,
  "610": 517,
  "613": 518,
  "614": 519,
  "615": 520,
  "616": 521,
  "618": 522,
  "619": 523,
  "62": 524,
  "620": 525,
  "621": 526,
  "622": 527,
  "623": 528,
  "624": 529,
  "625": 530,
  "626": 531,
  "627": 532,
  "628": 533,
  "63": 534,
  "630": 535,
  "632": 536,
  "633": 537,
  "635": 538,
  "636": 539,
  "637": 540,
  "638": 541,
  "639": 542,
  "64": 543,
  "641": 544,
  "644": 545,
  "646": 546,
  "647": 547,
  "65": 548,
  "651": 549,
  "652": 550,
  "653": 551,
  "654": 552,
  "655": 553,
  "656": 554,
  "658": 555,
  "659": 556,
  "66": 557,
  "661": 558,
  "662": 559,
  "663": 560,
  "664": 561,
  "665": 562,
  "666": 563,
  "668": 564,
  "67": 565,
  "670": 566,
  "671": 567,
  "675": 568,
  "676": 569,
  "679": 570,
  "68": 571,
  "680": 572,
  "681": 573,
  "682": 574,
  "683": 575,
  "685": 576,
  "686": 577,
  "687": 578,
  "688": 579,
  "689": 580,
  "69": 581,
  "691": 582,
  "693": 583,
  "695": 584,
  "696": 585,
  "697": 586,
  "698": 587,
  "699": 588,
  "70": 589,
  "700": 590,
  "701": 591,
  "703": 592,
  "704": 593,
  "705": 594,
  "708": 595,
  "71": 596,
  "710": 597,
  "712": 598,
  "713": 599,
  "714": 600,
  "715": 601,
  "716": 602,
  "717": 603,
  "718": 604,
  "719": 605,
  "72": 606,
  "720": 607,
  "722": 608,
  "723": 609,
  "725": 610,
  "726": 611,
  "728": 612,
  "729": 613,
  "73": 614,
  "730": 615,
  "732": 616,
  "733": 617,
  "734": 618,
  "736": 619,
  "737": 620,
  "738": 621,
  "74": 622,
  "740": 623,
  "744": 624,
  "749": 625,
  "75": 626,
  "750": 627,
  "751": 628,
  "753": 629,
  "755": 630,
  "76": 631,
  "760": 632,
  "761": 633,
  "762": 634,
  "763": 635,
  "765": 636,
  "766": 637,
  "767": 638,
  "768": 639,
  "769": 640,
  "77": 641,
  "770": 642,
  "771": 643,
  "772": 644,
  "773": 645,
  "774": 646,
  "777": 647,
  "778": 648,
  "78": 649,
  "780": 650,
  "782": 651,
  "784": 652,
  "786": 653,
  "788": 654,
  "79": 655,
  "790": 656,
  "791": 657,
  "792": 658,
  "793": 659,
  "794": 660,
  "795": 661,
  "796": 662,
  "798": 663,
  "799": 664,
  "80": 665,
  "800": 666,
  "801": 667,
  "802": 668,
  "803": 669,
  "804": 670,
  "805": 671,
  "809": 672,
  "81": 673,
  "810": 674,
  "811": 675,
  "812": 676,
  "813": 677,
  "814": 678,
  "815": 679,
  "816": 680,
  "818": 681,
  "82": 682,
  "820": 683,
  "825": 684,
  "826": 685,
  "827": 686,
  "828": 687,
  "829": 688,
  "830": 689,
  "831": 690,
  "832": 691,
  "834": 692,
  "835": 693,
  "836": 694,
  "837": 695,
  "839": 696,
  "84": 697,
  "841": 698,
  "843": 699,
  "844": 700,
  "845": 701,
  "846": 702,
  "847": 703,
  "848": 704,
  "85": 705,
  "850": 706,
  "851": 707,
  "853": 708,
  "854": 709,
  "855": 710,
  "856": 711,
  "857": 712,
  "859": 713,
  "860": 714,
  "862": 715,
  "863": 716,
  "864": 717,
  "866": 718,
  "868": 719,
  "869": 720,
  "87": 721,
  "871": 722,
  "872": 723,
  "873": 724,
  "875": 725,
  "876": 726,
  "878": 727,
  "879": 728,
  "88": 729,
  "881": 730,
  "882": 731,
  "883": 732,
  "884": 733,
  "885": 734,
  "887": 735,
  "889": 736,
  "89": 737,
  "890": 738,
  "891": 739,
  "892": 740,
  "893": 741,
  "894": 742,
  "895": 743,
  "896": 744,
  "898": 745,
  "899": 746,
  "90": 747,
  "901": 748,
  "902": 749,
  "904": 750,
  "905": 751,
  "906": 752,
  "908": 753,
  "909": 754,
  "91": 755,
  "911": 756,
  "912": 757,
  "913": 758,
  "914": 759,
  "915": 760,
  "916": 761,
  "917": 762,
  "918": 763,
  "919": 764,
  "92": 765,
  "920": 766,
  "921": 767,
  "922": 768,
  "923": 769,
  "924": 770,
  "925": 771,
  "926": 772,
  "928": 773,
  "929": 774,
  "93": 775,
  "930": 776,
  "934": 777,
  "935": 778,
  "937": 779,
  "94": 780,
  "941": 781,
  "942": 782,
  "943": 783,
  "944": 784,
  "945": 785,
  "946": 786,
  "95": 787,
  "950": 788,
  "951": 789,
  "952": 790,
  "953": 791,
  "954": 792,
  "956": 793,
  "957": 794,
  "958": 795,
  "959": 796,
  "96": 797,
  "961": 798,
  "962": 799,
  "965": 800,
  "967": 801,
  "968": 802,
  "97": 803,
  "970": 804,
  "972": 805,
  "973": 806,
  "974": 807,
  "978": 808,
  "98": 809,
  "981": 810,
  "983": 811,
  "984": 812,
  "985": 813,
  "987": 814,
  "988": 815,
  "989": 816,
  "99": 817,
  "992": 818,
  "993": 819,
  "994": 820,
  "996": 821,
  "997": 822,
  "998": 823,
  "bank": 824,
  "bonus": 825,
  "bonus payment": 826,
  "book": 827,
  "book purchase": 828,
  "bought": 829,
  "bought cinema": 830,
  "bought dental": 831,
  "bought dress": 832,
  "bought electronics": 833,
  "bought lunch": 834,
  "bought tickets": 835,
  "bus": 836,
  "bus costing": 837,
  "bus ticket": 838,
  "business": 839,
  "business income": 840,
  "cinema": 841,
  "client": 842,
  "client paid": 843,
  "clothes": 844,
  "coffee": 845,
  "coffee pastry": 846,
  "commission": 847,
  "commission earned": 848,
  "company": 849,
  "concert": 850,
  "concert tickets": 851,
  "consulting": 852,
  "consulting fee": 853,
  "cost": 854,
  "costing": 855,
  "costing dress": 856,
  "costing entertainment": 857,
  "costing gas": 858,
  "costing groceries": 859,
  "costing health": 860,
  "costing parking": 861,
  "costing rent": 862,
  "costing shirt": 863,
  "costing taxi": 864,
  "course": 865,
  "course fee": 866,
  "customer": 867,
  "dental": 868,
  "deposit": 869,
  "deposited": 870,
  "dinner": 871,
  "dinner restaurant": 872,
  "dividend": 873,
  "dividend payment": 874,
  "doctor": 875,
  "doctor visit": 876,
  "dress": 877,
  "earned": 878,
  "electricity": 879,
  "electronics": 880,
  "entertainment": 881,
  "family": 882,
  "fare": 883,
  "fee": 884,
  "food": 885,
  "freelance": 886,
  "freelance payment": 887,
  "friend": 888,
  "game": 889,
  "game costing": 890,
  "game purchase": 891,
  "gas": 892,
  "gas cost": 893,
  "gas costing": 894,
  "gave": 895,
  "gift": 896,
  "gift money": 897,
  "got": 898,
  "got gas": 899,
  "got paid": 900,
  "got shoes": 901,
  "got tickets": 902,
  "got transport": 903,
  "groceries": 904,
  "gym": 905,
  "gym membership": 906,
  "haircut": 907,
  "haircut costing": 908,
  "health": 909,
  "income": 910,
  "internet": 911,
  "internet cost": 912,
  "investment": 913,
  "invoice": 914,
  "invoice payment": 915,
  "job": 916,
  "learning": 917,
  "lunch": 918,
  "lunch cost": 919,
  "membership": 920,
  "money": 921,
  "monthly": 922,
  "monthly salary": 923,
  "movie": 924,
  "movie tickets": 925,
  "new": 926,
  "new clothes": 927,
  "office": 928,
  "online": 929,
  "online learning": 930,
  "online shopping": 931,
  "paid": 932,
  "parking": 933,
  "parking fee": 934,
  "pastry": 935,
  "paycheck": 936,
  "payment": 937,
  "payroll": 938,
  "payroll deposit": 939,
  "pharmacy": 940,
  "phone": 941,
  "project": 942,
  "project payment": 943,
  "purchase": 944,
  "purchased": 945,
  "purchased bus": 946,
  "purchased costing": 947,
  "purchased game": 948,
  "purchased gas": 949,
  "purchased haircut": 950,
  "purchased taxi": 951,
  "received": 952,
  "received paycheck": 953,
  "refund": 954,
  "refund received": 955,
  "rent": 956,
  "rent payment": 957,
  "restaurant": 958,
  "ride": 959,
  "salary": 960,
  "salary deposited": 961,
  "shirt": 962,
  "shoes": 963,
  "shoes cost": 964,
  "shopping": 965,
  "snack": 966,
  "spent": 967,
  "streaming": 968,
  "streaming subscription": 969,
  "subscription": 970,
  "supermarket": 971,
  "takeout": 972,
  "takeout food": 973,
  "taxi": 974,
  "taxi costing": 975,
  "taxi fare": 976,
  "ticket": 977,
  "tickets": 978,
  "tickets cost": 979,
  "train": 980,
  "train ticket": 981,
  "transport": 982,
  "transport cost": 983,
  "treated": 984,
  "treated electricity": 985,
  "treated entertainment": 986,
  "treated gas": 987,
  "treated lunch": 988,
  "treated movie": 989,
  "tshirt": 990,
  "tuition": 991,
  "tuition fee": 992,
  "uber": 993,
  "uber ride": 994,
  "utilities": 995,
  "visit": 996,
  "water": 997,
  "work": 998,
  "work payment": 999,
  "<UNK>": 1000
}